; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob63) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate1)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate7)
	(at pallet6 depot1)
	(clear pallet6)
	(at pallet7 depot0)
	(clear crate8)
	(at pallet8 distributor0)
	(clear crate6)
	(at pallet9 depot2)
	(clear pallet9)
	(at pallet10 distributor1)
	(clear crate4)
	(at pallet11 distributor2)
	(clear pallet11)
	(at truck0 distributor0)
	(at truck1 distributor2)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at hoist9 distributor0)
	(available hoist9)
	(at hoist10 distributor1)
	(available hoist10)
	(at hoist11 distributor2)
	(available hoist11)
	(at hoist12 depot1)
	(available hoist12)
	(at hoist13 depot1)
	(available hoist13)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 depot0)
	(on crate2 pallet7)
	(at crate3 distributor0)
	(on crate3 pallet8)
	(at crate4 distributor1)
	(on crate4 pallet10)
	(at crate5 distributor0)
	(on crate5 crate3)
	(at crate6 distributor0)
	(on crate6 crate5)
	(at crate7 distributor2)
	(on crate7 pallet5)
	(at crate8 depot0)
	(on crate8 crate2)
)

(:goal (and
		(on crate0 crate4)
		(on crate1 pallet5)
		(on crate2 pallet7)
		(on crate3 pallet3)
		(on crate4 pallet9)
		(on crate6 pallet6)
		(on crate8 crate6)
	)
))

; plan
1. (drive truck1 distributor2 depot0)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot0)
   goals met: 1 of 7
2. (lift hoist6 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist6) (on crate1 pallet2)
   added: (lifting hoist6 crate1) (clear pallet2)
   goals met: 1 of 7
3. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 1 of 7
4. (load hoist0 crate0 truck1 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck1) (available hoist0)
   goals met: 1 of 7
5. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 1 of 7
6. (unload hoist7 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist7)
   added: (lifting hoist7 crate0)
   goals met: 1 of 7
7. (lift hoist0 crate8 crate2 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate2)
   added: (lifting hoist0 crate8) (clear crate2)
   goals met: 1 of 7
8. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 1 of 7
9. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   goals met: 1 of 7
10. (drive truck0 depot0 depot2)
   deleted: (at truck0 depot0)
   added: (at truck0 depot2)
   goals met: 1 of 7
11. (drive truck0 depot2 distributor0)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor0)
   goals met: 1 of 7
12. (unload hoist9 crate8 truck0 distributor0)
   deleted: (in crate8 truck0) (available hoist9)
   added: (lifting hoist9 crate8)
   goals met: 1 of 7
13. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   goals met: 1 of 7
14. (load hoist6 crate1 truck0 depot2)
   deleted: (lifting hoist6 crate1)
   added: (in crate1 truck0) (available hoist6)
   goals met: 1 of 7
15. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   goals met: 1 of 7
16. (unload hoist8 crate1 truck0 distributor2)
   deleted: (in crate1 truck0) (available hoist8)
   added: (lifting hoist8 crate1)
   goals met: 1 of 7
17. (lift hoist5 crate7 pallet5 distributor2)
   deleted: (at crate7 distributor2) (clear crate7) (available hoist5) (on crate7 pallet5)
   added: (lifting hoist5 crate7) (clear pallet5)
   goals met: 1 of 7
18. (drop hoist8 crate1 pallet5 distributor2)
   deleted: (lifting hoist8 crate1) (clear pallet5)
   added: (available hoist8) (at crate1 distributor2) (clear crate1) (on crate1 pallet5)
   goals met: 2 of 7
19. (lift hoist3 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 crate5)
   added: (lifting hoist3 crate6) (clear crate5)
   goals met: 2 of 7
20. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   goals met: 2 of 7
21. (load hoist3 crate6 truck0 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   goals met: 2 of 7
22. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 2 of 7
23. (unload hoist13 crate6 truck0 depot1)
   deleted: (in crate6 truck0) (available hoist13)
   added: (lifting hoist13 crate6)
   goals met: 2 of 7
24. (drop hoist13 crate6 pallet6 depot1)
   deleted: (lifting hoist13 crate6) (clear pallet6)
   added: (available hoist13) (at crate6 depot1) (clear crate6) (on crate6 pallet6)
   goals met: 3 of 7
25. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 3 of 7
26. (load hoist9 crate8 truck0 distributor0)
   deleted: (lifting hoist9 crate8)
   added: (in crate8 truck0) (available hoist9)
   goals met: 3 of 7
27. (drive truck0 distributor0 depot1)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot1)
   goals met: 3 of 7
28. (unload hoist13 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist13)
   added: (lifting hoist13 crate8)
   goals met: 3 of 7
29. (lift hoist3 crate5 crate3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist3) (on crate5 crate3)
   added: (lifting hoist3 crate5) (clear crate3)
   goals met: 3 of 7
30. (lift hoist9 crate3 pallet8 distributor0)
   deleted: (at crate3 distributor0) (clear crate3) (available hoist9) (on crate3 pallet8)
   added: (lifting hoist9 crate3) (clear pallet8)
   goals met: 3 of 7
31. (drop hoist9 crate3 pallet3 distributor0)
   deleted: (lifting hoist9 crate3) (clear pallet3)
   added: (available hoist9) (at crate3 distributor0) (clear crate3) (on crate3 pallet3)
   goals met: 4 of 7
32. (drop hoist13 crate8 crate6 depot1)
   deleted: (lifting hoist13 crate8) (clear crate6)
   added: (available hoist13) (at crate8 depot1) (clear crate8) (on crate8 crate6)
   goals met: 5 of 7
33. (lift hoist4 crate4 pallet10 distributor1)
   deleted: (at crate4 distributor1) (clear crate4) (available hoist4) (on crate4 pallet10)
   added: (lifting hoist4 crate4) (clear pallet10)
   goals met: 5 of 7
34. (load hoist4 crate4 truck1 distributor1)
   deleted: (lifting hoist4 crate4)
   added: (in crate4 truck1) (available hoist4)
   goals met: 5 of 7
35. (drive truck1 distributor1 depot2)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot2)
   goals met: 5 of 7
36. (unload hoist6 crate4 truck1 depot2)
   deleted: (in crate4 truck1) (available hoist6)
   added: (lifting hoist6 crate4)
   goals met: 5 of 7
37. (drop hoist6 crate4 pallet9 depot2)
   deleted: (lifting hoist6 crate4) (clear pallet9)
   added: (available hoist6) (at crate4 depot2) (clear crate4) (on crate4 pallet9)
   goals met: 6 of 7
38. (drive truck0 depot1 distributor1)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor1)
   goals met: 6 of 7
39. (load hoist7 crate0 truck0 distributor1)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck0) (available hoist7)
   goals met: 6 of 7
40. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 6 of 7
41. (unload hoist6 crate0 truck0 depot2)
   deleted: (in crate0 truck0) (available hoist6)
   added: (lifting hoist6 crate0)
   goals met: 6 of 7
42. (drop hoist6 crate0 crate4 depot2)
   deleted: (lifting hoist6 crate0) (clear crate4)
   added: (available hoist6) (at crate0 depot2) (clear crate0) (on crate0 crate4)
   goals met: 7 of 7
